## Data Frame
- Pandas는 라벨이 붙어있는 2차원 배열(DataFrame)이나 1차원 배열(Series)을 다루는 도구
- 2차원 배열(DataFrame)의 행에 붙어 있는 라벨을 index(인덱스)라 부름
- 2차원 배열(DataFrame)의 열에 붙어 있는 라벨을 column(컬럼) 또는 변수라 부름
- 1차원 배열에는 행에만 라벨이 붙어 있고, 이를 index(인덱스)라고 부름

## Lab 3 : 외부 데이터 이용하기
- 분석할 데이터를 엑셀 데이터에서 가져 오기(https://bit.ly/doit_python)
- pd.read_excel('excel_exam_xlsx')
- 첫번째 행을 컬럼으로 지정하고, 인덱스는 0부터 할당됨
- 특정 컬럼을 인덱스로 만들기 위해서는 set_index() 함수 사용

In [1]:
import pandas as pd

In [2]:
df_exam = pd.read_excel('excel_exam.xlsx')

In [3]:
df_exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [4]:
df_exam = pd.read_excel('excel_exam.xlsx').set_index('id')

In [5]:
df_exam.head()

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        1    45       86       78
4        1    30       98       58
5        2    25       80       65

> 데이터 분석하기

In [6]:
df_exam['math'].sum()

1149

In [7]:
len(df_exam)

20

In [8]:
df_exam.sum()

nclass       60
math       1149
english    1698
science    1189
dtype: int64

In [9]:
df_exam.mean()

nclass      3.00
math       57.45
english    84.90
science    59.45
dtype: float64

# Lab 4 엑셀의 첫번째 행이 변수명(컬럼 이름)이 아닌 경우
- 첫번째 행의 데이터를 컬럼 이름으로 인식함
- Lab4에서 사용한 엑셀 파일에서 첫 햇을 삭제하여 실습에 사용

In [11]:
pd_excel_exam_novar = pd.read_excel('excel_exam_novar.xlsx')
pd_excel_exam_novar.head()

   1  1.1  50  98  50.1
0  2    1  60  97    60
1  3    2  25  80    65
2  4    2  50  89    98
3  5    3  20  98    15
4  6    3  50  98    45

In [13]:
pd_excel_exam_novar = pd.read_excel('excel_exam_novar.xlsx', header = None)
pd_excel_exam_novar.head()

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15

In [14]:
pd_excel_exam_novar.columns

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [15]:
pd_excel_exam_novar.columns = ['id','nclass','math','english','science']
pd_excel_exam_novar.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       2    25       80       65
3   4       2    50       89       98
4   5       3    20       98       15

In [16]:
pd_excel_exam_novar.set_index('id')

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        2    25       80       65
4        2    50       89       98
5        3    20       98       15
6        3    50       98       45
7        4    46       98       65
8        4    48       87       12

## Lab 5 : CSV 파일 불러오기
- Lab 4에서 사용한 엑셀 파일을 csv 유형 파일로 저장
- csv 파일 : 값이 쉼표(,)로 구분되어 저장된 자료 형태

In [17]:
import pandas as pd
df_exam_csv = pd.read_csv('exam.csv')

In [18]:
df_exam_csv.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

## 실습
- df_exam에서 math,english,science의  성적인 50점 이상인 학생의 수를 구하시오
- df_exam에서 math의 성적 평균을 구하시오

In [22]:
(df_exam_csv[['math','english','science']] > 50).sum()

math       10
english    20
science    13
dtype: int64

In [19]:
df_exam_csv['math'].mean()

57.45